#   Group B
 Asignment no 02

Perform the following operations using Python on the Air quality Data set , and Heart Diseases data sets: 

     a. Data cleaning
     b. Data integration
     c. Data transformation
     d. Error correcting
      e. Data model building

  Data set use:  1) Air quality Data set
                 2) Heart Diseases data sets

In [1]:
import pandas as pd
import numpy as np
df=pd.read_csv("AirQuality.csv",encoding='cp1252')

C:\Users\Admin\AppData\Local\Temp\ipykernel_7816\4059217266.py:3: DtypeWarning: Columns (0) have mixed types. Specify dtype option on import or set low_memory=False.
  df=pd.read_csv("AirQuality.csv",encoding='cp1252')

 #  a)  Cleaning the dataset

1. Dropping columns  -  which do not provide more information
2. Dropping row where data is not available

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 435742 entries, 0 to 435741
Data columns (total 13 columns):
stn_code                       291665 non-null object
sampling_date                  435739 non-null object
state                          435742 non-null object
location                       435739 non-null object
agency                         286261 non-null object
type                           430349 non-null object
so2                            401096 non-null float64
no2                            419509 non-null float64
rspm                           395520 non-null float64
spm                            198355 non-null float64
location_monitoring_station    408251 non-null object
pm2_5                          9314 non-null float64
date                           435735 non-null object
dtypes: float64(5), object(8)
memory usage: 43.2+ MB

In [11]:
#  Dropping columns which are not required
df = df.drop(['stn_code','agency', 'location_monitoring_station'],axis=1)

In [12]:
df.isna().sum()

sampling_date         3
state                 0
location              3
type               5393
so2               34646
no2               16233
rspm              40222
spm              237387
pm2_5            426428
date                  7
dtype: int64

In [13]:
df = df.dropna(subset=['date'])

In [14]:
df.isna().sum()

sampling_date         0
state                 0
location              0
type               5390
so2               34643
no2               16230
rspm              40219
spm              237380
pm2_5            426421
date                  0
dtype: int64

In [15]:
df.columns

Index(['sampling_date', 'state', 'location', 'type', 'so2', 'no2', 'rspm',
       'spm', 'pm2_5', 'date'],
      dtype='object')

# Changing the types to uniform format

Notice that the 'Types column has values such as 'Industrial Area' and 'Indistrial Areas'
Both are same and make it uniform

In [16]:
df['type'].unique()

array(['Residential, Rural and other Areas', 'Industrial Area', nan,
       'Sensitive Area', 'Industrial Areas', 'Residential and others',
       'Sensitive Areas', 'Industrial', 'Residential', 'RIRUO',
       'Sensitive'], dtype=object)

In [4]:
types = {
    
    "Residential" : "K",
    "Residential and others" : "RO",
    "Industrial Area":"I" ,
    "Industrial Areas" : "I",
    "Industrial" : "I" ,
    "Sensitive Area": "s",
    "Sensitive Areas":"s",
    "Sensitive":"s",
    "NaN":"PRO",
    "Residential, Rural and other Areas":"MO"
 }

In [6]:
df.type = df.type.replace(types)

In [69]:

df['type'].unique()

array(['MO', 'I', nan, 's', 'RO', 'K', 'RIRUO'], dtype=object)

In [7]:
# convert date to 'date' format

df['date']=pd.to_datetime(df['date'], errors="coerce")
df.head(5)

,sampling_date,state,location,type,so2,no2,rspm,spm,pm2_5,date
0,February - M021990,Andhra Pradesh,Hyderabad,MO,4.8,17.4,NaN,NaN,NaN,1990-02-01
1,February - M021990,Andhra Pradesh,Hyderabad,I,3.1,7.0,NaN,NaN,NaN,1990-02-01
2,February - M021990,Andhra Pradesh,Hyderabad,MO,6.2,28.5,NaN,NaN,NaN,1990-02-01
3,March - M031990,Andhra Pradesh,Hyderabad,MO,6.3,14.7,NaN,NaN,NaN,1990-03-01
4,March - M031990,Andhra Pradesh,Hyderabad,I,4.7,7.5,NaN,NaN,NaN,1990-03-01

In [90]:
# Create a new column 'year'  from 'date' column

df['year']=df.date.dt.year
df.head()

,sampling_date,state,location,type,so2,no2,rspm,spm,pm2_5,date,year
0,February - M021990,Andhra Pradesh,Hyderabad,MO,4.8,17.4,NaN,NaN,NaN,1990-02-01,1990
1,February - M021990,Andhra Pradesh,Hyderabad,I,3.1,7.0,NaN,NaN,NaN,1990-02-01,1990
2,February - M021990,Andhra Pradesh,Hyderabad,MO,6.2,28.5,NaN,NaN,NaN,1990-02-01,1990
3,March - M031990,Andhra Pradesh,Hyderabad,MO,6.3,14.7,NaN,NaN,NaN,1990-03-01,1990
4,March - M031990,Andhra Pradesh,Hyderabad,I,4.7,7.5,NaN,NaN,NaN,1990-03-01,1990

# Handling missing values

In [8]:
#  define columns of importance, which shall be used regularely

COLS = ['so2','no2', 'rspm', 'spm', 'pm2_5']

In [10]:
import numpy as np
from sklearn.impute import SimpleImputer

# invoking SimpleImputer to fill missing values

imputer = SimpleImputer(missing_values = np.nan, strategy='mean')

In [11]:
df[COLS] = imputer.fit_transform(df[COLS])

In [12]:
df.head()

,sampling_date,state,location,type,so2,no2,rspm,spm,pm2_5,date
0,February - M021990,Andhra Pradesh,Hyderabad,MO,4.8,17.4,108.833091,220.78348,40.791467,1990-02-01
1,February - M021990,Andhra Pradesh,Hyderabad,I,3.1,7.0,108.833091,220.78348,40.791467,1990-02-01
2,February - M021990,Andhra Pradesh,Hyderabad,MO,6.2,28.5,108.833091,220.78348,40.791467,1990-02-01
3,March - M031990,Andhra Pradesh,Hyderabad,MO,6.3,14.7,108.833091,220.78348,40.791467,1990-03-01
4,March - M031990,Andhra Pradesh,Hyderabad,I,4.7,7.5,108.833091,220.78348,40.791467,1990-03-01

# Data Transformation
Filtering, cleaning,
and other tranformations are another class of important operations.

Removing Duplicates: 
Duplicate rows may be found in a DataFrame for any number of reasons.

In [28]:
df.nunique()

sampling_date    5482
state              34
location          304
type               10
so2              4197
no2              6864
rspm             6065
spm              6668
pm2_5             433
date             5067
dtype: int64

In [49]:
df.duplicated().sum()

674

In [48]:
df.drop_duplicates()

,stn_code,sampling_date,state,location,agency,type,so2,no2,rspm,spm,location_monitoring_station,pm2_5,date
0,150.0,February - M021990,Andhra Pradesh,Hyderabad,NaN,"Residential, Rural and other Areas",4.8,17.4,NaN,NaN,NaN,NaN,1990-02-01
1,151.0,February - M021990,Andhra Pradesh,Hyderabad,NaN,Industrial Area,3.1,7.0,NaN,NaN,NaN,NaN,1990-02-01
2,152.0,February - M021990,Andhra Pradesh,Hyderabad,NaN,"Residential, Rural and other Areas",6.2,28.5,NaN,NaN,NaN,NaN,1990-02-01
3,150.0,March - M031990,Andhra Pradesh,Hyderabad,NaN,"Residential, Rural and other Areas",6.3,14.7,NaN,NaN,NaN,NaN,1990-03-01
4,151.0,March - M031990,Andhra Pradesh,Hyderabad,NaN,Industrial Area,4.7,7.5,NaN,NaN,NaN,NaN,1990-03-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...
435737,SAMP,24-12-15,West Bengal,ULUBERIA,West Bengal State Pollution Control Board,RIRUO,22.0,50.0,143.0,NaN,"Inside Rampal Industries,ULUBERIA",NaN,2015-12-24
435738,SAMP,29-12-15,West Bengal,ULUBERIA,West Bengal State Pollution Control Board,RIRUO,20.0,46.0,171.0,NaN,"Inside Rampal Industries,ULUBERIA",NaN,2015-12-29
435739,NaN,NaN,andaman-and-nicobar-islands,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
435740,NaN,NaN,Lakshadweep,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
435741,NaN,NaN,Tripura,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# Error correction

In [52]:
df.isnull().sum()

stn_code                       144077
sampling_date                       3
state                               0
location                            3
agency                         149481
type                             5393
so2                             34646
no2                             16233
rspm                            40222
spm                            237387
location_monitoring_station     27491
pm2_5                          426428
date                                7
dtype: int64

In [53]:
df=df.fillna(df.median())
df.isnull().sum()

stn_code                       144077
sampling_date                       3
state                               0
location                            3
agency                         149481
type                             5393
so2                                 0
no2                                 0
rspm                                0
spm                                 0
location_monitoring_station     27491
pm2_5                               0
date                                7
dtype: int64

Detecting and Filtering Outliers

In [51]:
df.describe()

                 so2            no2           rspm            spm        pm2_5
count  401096.000000  419509.000000  395520.000000  198355.000000  9314.000000
mean       10.829414      25.809623     108.832784     220.783480    40.791467
std        11.177187      18.503086      74.872430     151.395457    30.832525
min         0.000000       0.000000       0.000000       0.000000     3.000000
25%         5.000000      14.000000      56.000000     111.000000    24.000000
50%         8.000000      22.000000      90.000000     187.000000    32.000000
75%        13.700000      32.200000     142.000000     296.000000    46.000000
max       909.000000     876.000000    6307.033333    3380.000000   504.000000

In [62]:
df[df['so2']>100]=0

In [5]:
import pandas as pd
df = pd.read_csv('c:/Users/Rajendra/Downloads/heart.csv')

In [6]:
df.shape

(303, 14)

In [9]:
df.nunique()

age          41
sex           2
cp            4
trestbps     49
chol        152
fbs           2
restecg       3
thalach      91
exang         2
oldpeak      40
slope         3
ca            5
thal          4
target        2
dtype: int64

# change the categorical type to categorical variables
df['sex'] =df['sex'] .astype('object')
df['cp'] =df['cp'] .astype('object')
df['fbs'] =df['fbs'] .astype('object')
df['restecg'] =df['restecg'] .astype('object')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
age         303 non-null int64
sex         303 non-null int64
cp          303 non-null int64
trestbps    303 non-null int64
chol        303 non-null int64
fbs         303 non-null int64
restecg     303 non-null int64
thalach     303 non-null int64
exang       303 non-null int64
oldpeak     303 non-null float64
slope       303 non-null int64
ca          303 non-null int64
thal        303 non-null int64
target      303 non-null int64
dtypes: float64(1), int64(13)
memory usage: 33.2 KB

# Error correction
Check for the data character mistakes
Feature 'ca' ranges from 0-3, how ever df.unique() listed 0-4.  So let us find 4 and change them to NaN

In [11]:
df['ca'].unique()

array([0, 2, 1, 3, 4], dtype=int64)

In [12]:
df.ca.value_counts()

0    175
1     65
2     38
3     20
4      5
Name: ca, dtype: int64

In [13]:
df.loc[df['ca']==4]

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
92,52,1,2,138,223,0,1,169,0,0.0,2,4,2,1
158,58,1,1,125,220,0,1,144,0,0.4,1,4,3,1
163,38,1,2,138,175,0,1,173,0,0.0,2,4,2,1
164,38,1,2,138,175,0,1,173,0,0.0,2,4,2,1
251,43,1,0,132,247,1,0,143,1,0.1,1,4,3,0

In [14]:
df.loc[df['ca']==4,'ca']=np.NaN

NameError: name 'np' is not defined

In [15]:
df['ca'].unique()

array([0, 2, 1, 3, 4], dtype=int64)

In [16]:
df.isna().sum()

age         0
sex         0
cp          0
trestbps    0
chol        0
fbs         0
restecg     0
thalach     0
exang       0
oldpeak     0
slope       0
ca          0
thal        0
target      0
dtype: int64

In [17]:
df=df.fillna(df.median())
df.isnull().sum()

age         0
sex         0
cp          0
trestbps    0
chol        0
fbs         0
restecg     0
thalach     0
exang       0
oldpeak     0
slope       0
ca          0
thal        0
target      0
dtype: int64


# Checking for duplicate row

In [18]:
duplicates = df.duplicated(keep=False).sum()
duplicates

2

# e. Data model building

Metrics for Classification technique

In [22]:
from sklearn.model_selection import train_test_split
from sklearn import svm
from sklearn.metrics import classification_report,confusion_matrix,accuracy_score

In [23]:
# Splitting our Dataset

X = df.drop('target', axis=1)
y = df.target

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=1)

In [24]:
#Import svm model
from sklearn import svm

#Create a svm Classifier
clf = svm.SVC(kernel='linear') # Linear Kernel

#Train the model using the training sets
clf.fit(X_train, y_train)

#Predict the response for test dataset
y_pred = clf.predict( X_test)

Evaluating the Model
Accuracy can be computed by comparing actual test set values and predicted values.

In [25]:
from sklearn import metrics

# Model Accuracy
accuracy = metrics.accuracy_score(y_test, y_pred)
print("Accuracy:", accuracy)

Accuracy: 0.7692307692307693

In [26]:
# Model Precision: what percentage of positive tuples are labeled as such?
print("Precision:",metrics.precision_score(y_test, y_pred))

# Model Recall: what percentage of positive tuples are labelled as such?
print("Recall:",metrics.recall_score(y_test, y_pred))

Precision: 0.7735849056603774
Recall: 0.82